#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.archive_file.lambda_package: Reading...
random_password.api_auth_token: Refreshing state... [id=none]
data.aws_secretsmanager_secret.stripe_api_key: Reading...
data.aws_iam_policy_document.lambda: Reading...
data.aws_iam_policy_document.lambda_logging: Reading...
aws_secretsmanager_secret.api_auth_token: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:smart-home-subscription-service-test-api-token-cV4zmc]
aws_api_gateway_rest_api.monolith: Refreshing state... [id=nqag43kd6l]
data.aws_iam_policy_document.lambda: Read complete after 0s [id=2690255455]
aws_iam_role.lambda: Refreshing state... [id=smart-home-subscription-service-test-lambda]
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=4224822605]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::757214766189:policy/smart-home-subscription-service-test-lambda-logging]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=smart-home-subscription-service-test-lambda-20230624064622592500000001]
data.aws_secretsmanager_secret.stripe_api_key: Read complete after 1s [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:stripe-api-keys-test-PRbf1C]
data.archive_file.lambda_package: Read complete after 3s [id=af34d9a793585f0718ea2d95aab79a646bb00bbe]
data.aws_secretsmanager_secret_version.stripe_api_key: Reading...
aws_secretsmanager_secret_version.api_auth_token: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:smart-home-subscription-service-test-api-token-cV4zmc|257F268E-7D99-40C6-BBDE-917E2041ED30]
data.aws_secretsmanager_secret_version.stripe_api_key: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:stripe-api-keys-test-PRbf1C|AWSCURRENT]
aws_lambda_function.monolith: Refreshing state... [id=smart-home-subscription-service-test-monolith]
aws_api_gateway_resource.root_proxy: Refreshing state... [id=m5gw3u]
aws_api_gateway_method.root_proxy_options: Refreshing state... [id=agm-nqag43kd6l-m5gw3u-OPTIONS]
aws_api_gateway_method.root_proxy_any: Refreshing state... [id=agm-nqag43kd6l-m5gw3u-ANY]
aws_api_gateway_method_response.root_proxy_any_200: Refreshing state... [id=agmr-nqag43kd6l-m5gw3u-ANY-200]
aws_api_gateway_method_response.root_proxy_options_200: Refreshing state... [id=agmr-nqag43kd6l-m5gw3u-OPTIONS-200]
aws_api_gateway_integration.root_proxy_options_mock: Refreshing state... [id=agi-nqag43kd6l-m5gw3u-OPTIONS]
aws_api_gateway_integration_response.root_proxy_options_mock: Refreshing state... [id=agir-nqag43kd6l-m5gw3u-OPTIONS-200]
aws_api_gateway_integration_response.root_proxy_options_200: Refreshing state... [id=agir-nqag43kd6l-m5gw3u-OPTIONS-200]
aws_api_gateway_integration.root_proxy: Refreshing state... [id=agi-nqag43kd6l-m5gw3u-ANY]
aws_lambda_permission.api_gateway_invocation: Refreshing state... [id=AllowExecutionFromApiGateway]
aws_api_gateway_deployment.monolith: Refreshing state... [id=3o196h]
aws_api_gateway_integration_response.root_proxy_any_200: Refreshing state... [id=agir-nqag43kd6l-m5gw3u-ANY-200]
aws_api_gateway_stage.monolith: Refreshing state... [id=ags-nqag43kd6l-v1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.monolith will be updated in-place
  ~ resource "aws_lambda_function" "monolith" {
        id                             = "smart-home-subscription-service-test-monolith"
      ~ last_modified                  = "2023-06-29T07:31:18.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:757214766189:function:smart-home-subscription-service-test-monolith:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:757214766189:function:smart-home-subscription-service-test-monolith:11/invocations" -> (known after apply)
      ~ source_code_hash               = "mGNKeYZVlL058Hm4zKmccEVghojuFoqlKXDxdYxZunM=" -> "nF0aqFjbcX9gHEfdYACbO/Fkfwf5iJcjhFmCIRyesjk="
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Workflow: `Deployment`*